:PROPERTIES:
:ID: 0bfca9d4-2f97-4cfa-b7d5-cd97318855ba
:END:
#+title: Preview Cleanup SQL
#+description: Preview Cleanup SQL
#+type: recipe
#+version: 2
#+level: cross
#+filetags: :recipe:sql:database_management:
#+created: 2026-05-21
#+updated: 2026-05-21

Generate cleanup SQL without executing (for review):

#+begin_src sql
select ores_utility_generate_cleanup_test_databases_sql_fn();
#+end_src

#+RESULTS:
#+begin_example
ores_utility_generate_cleanup_test_databases_sql_fn
-- No test databases found to clean up.
#+end_example
